Importing Libraries

In [2]:
import pandas as pd 
import numpy as np

Reading csv file with help of pandas 
As we have imported Pandas as pd, we will be using pd which includes read_csv as its parameter

In [3]:
df = pd.read_csv("Data.csv")

Checking structure of file whether it has been uploaded

In [4]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

Checking for null values

In [5]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

Calculating Mean so we can use same for Null value imputation

In [6]:
MeanAge = df['Age'].mean()
MeanSal = df['Salary'].mean()

In [7]:
MeanAge

38.77777777777778

In [8]:
MeanSal

63777.77777777778

Imputing Null values with mean

In [9]:
df['Salary'] = df['Salary'].fillna(MeanSal)
df['Age'] = df['Salary'].fillna(MeanSal)

Seperating X and Y values with help of iloc

[:,:-1] will include values except column -1 i.e Purchased

[:,:-1] will include column -1 i.e Purchased

In [11]:
X = df.iloc[:,:-1]
Y = df.iloc[:,-1]

In [12]:
X

   Country           Age        Salary
0   France  72000.000000  72000.000000
1    Spain  48000.000000  48000.000000
2  Germany  54000.000000  54000.000000
3    Spain  61000.000000  61000.000000
4  Germany  63777.777778  63777.777778
5   France  58000.000000  58000.000000
6    Spain  52000.000000  52000.000000
7   France  79000.000000  79000.000000
8  Germany  83000.000000  83000.000000
9   France  67000.000000  67000.000000

In [13]:
Y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

As Y only contains 2 values Yes and No, we will simply do Label encoding

In [14]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
Y = le.fit_transform(Y)

For Country Categorical variable, we will use One hot encoding here.
Get_dummies will give us the values for the same.
Drop_first will drop the first column as we can receive the output with help of remaining ones

In [18]:
Country_C = pd.get_dummies(df['Country'],drop_first=True)

In [19]:
Country_C

   Germany  Spain
0        0      0
1        0      1
2        1      0
3        0      1
4        1      0
5        0      0
6        0      1
7        0      0
8        1      0
9        0      0

deleting country so we can add the encoded one later

In [20]:
del X["Country"]

In [22]:
X  = pd.concat([X, Country_C],axis=1)

In [23]:
X

            Age        Salary  Germany  Spain
0  72000.000000  72000.000000        0      0
1  48000.000000  48000.000000        0      1
2  54000.000000  54000.000000        1      0
3  61000.000000  61000.000000        0      1
4  63777.777778  63777.777778        1      0
5  58000.000000  58000.000000        0      0
6  52000.000000  52000.000000        0      1
7  79000.000000  79000.000000        0      0
8  83000.000000  83000.000000        1      0
9  67000.000000  67000.000000        0      0

scaling is a method used to normalize the range of independent variables or features of data

In [24]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
sc_X = sc.fit_transform(X)

In [34]:
sc_X

array([[ 7.49473254e-01,  7.49473254e-01, -6.54653671e-01,
        -6.54653671e-01],
       [-1.43817841e+00, -1.43817841e+00, -6.54653671e-01,
         1.52752523e+00],
       [-8.91265492e-01, -8.91265492e-01,  1.52752523e+00,
        -6.54653671e-01],
       [-2.53200424e-01, -2.53200424e-01, -6.54653671e-01,
         1.52752523e+00],
       [ 6.63219199e-16,  6.63219199e-16,  1.52752523e+00,
        -6.54653671e-01],
       [-5.26656882e-01, -5.26656882e-01, -6.54653671e-01,
        -6.54653671e-01],
       [-1.07356980e+00, -1.07356980e+00, -6.54653671e-01,
         1.52752523e+00],
       [ 1.38753832e+00,  1.38753832e+00, -6.54653671e-01,
        -6.54653671e-01],
       [ 1.75214693e+00,  1.75214693e+00,  1.52752523e+00,
        -6.54653671e-01],
       [ 2.93712492e-01,  2.93712492e-01, -6.54653671e-01,
        -6.54653671e-01]])